import { DataCardsI18nType } from '../types'

export const cardsI18n: DataCardsI18nType = [
  {
    name: 'Короткое замыкание',
    desc: 'Все игроки теряют 8 данных',
  },
  {
    name: 'Сотрудничество с иностранцами',
    desc: '+2 данных. +2 денег. Сыграй снова',
  },
  {
    name: 'Статья',
    desc: '+1 Публикация. Сыграй снова',
  },
  {
    name: 'Закупка оборудования',
    desc: '+1 Оборудование',
  },
  {
    name: 'Украсть технологию',
    desc: 'Если оборудование < вражеского, +2 оборудования. Еще, +1 оборудование',
  },
  {
    name: 'Спонсоры',
    desc: '+4 Публикаций. +1 оборудование',
  },
  {
    name: 'Заказные статьи',
    desc: '+5 Публикаций. Ты потерял 6 денег',
  },
  {
    name: 'Копирование оборудования',
    desc: 'Если оборудование < вражеского, оборудование = вражеское оборудование',
  },
  {
    name: 'Обычная статья',
    desc: '+3 Публикации',
  },
  {
    name: 'Необычная статья',
    desc: '+4 к Публикациям',
  },
  {
    name: 'Инновации',
    desc: '+1 к Оборудованию у обоих игроков. Вы получаете + 4 деньгами',
  },
  {
    name: 'Подъём',
    desc: 'Если публикаци = 0, то +6 к публикациям. Иначе +3 к публикациям',
  },
  {
    name: 'Атака комисии',
    desc: '-5 к публикациям обоих игроков. Сыграй снова',
  },
  {
    name: 'Публичная лекция',
    desc: '+1 к престижу. Ходите снова',
  },
  {
    name: 'Короткое замыкание',
    desc: '-1 к оборудованию у обоих игроков',
  },
  {
    name: 'Ряд научных статей',
    desc: '+6 к публикациям',
  },
  {
    name: 'Вандализм',
    desc: '-1 к оборудованию врага',
  },
  {
    name: 'Выгодная покупка',
    desc: '+2 Оборудования',
  },
  {
    name: 'Эксперименты',
    desc: '-1 Оборудование. +10 Публикаций. Прирост 5 денег',
  },
  {
    name: 'Выступление',
    desc: '+8 к публикациям',
  },
  {
    name: 'Привлечение молодежи',
    desc: '+5 к публикациям. +1 к персоналу',
  },
  {
    name: 'Выйграть грант',
    desc: '+7 Публикаций, прирост 7 денег',
  },
  {
    name: 'Продуктивная работа',
    desc: '+6 Публикациям, +3 исследованиям',
  },
  {
    name: 'Крутая стаья',
    desc: '+12 к публикациям',
  },
  {
    name: 'Наука в быту',
    desc: '+8 к публикациям, +5 к исследованиям',
  },
  {
    name: 'Всероссийкая статья',
    desc: '+15 к Публикациям',
  },
  {
    name: 'Победа в дебатах',
    desc: '+6 Публикациям. 10 урона врагу',
  },
  {
    name: 'Мировая статья',
    desc: '+20 Публикаций. +8 исследования',
  },
  {
    name: 'Сверхурочные',
    desc: '+9 Публикаций, потеряйте 5 человекочасов',
  },
  {
    name: 'Небольшой успех',
    desc: '+1 Публикация. +1 к исследовании. +2 человекочаса',
  },
  {
    name: 'Утечка кадров',
    desc: 'Игроки с самой низкой Публикацией -1 персонал и 2 урона по исследованиям',
  },
  {
    name: 'Новый корпус',
    desc: '+6 человекочасов, +6 Публикаций. Если персонал < впажеского персонала, +1 персонал',
  },
  {
    name: 'Разоблачающая статья',
    desc: '+7 Публикаций, 6 урона врагу',
  },
  {
    name: 'Обмен патентами',
    desc: 'Поменяйте свои Публикации на Публикации врага',
  },
  {
    name: 'Новая мысль',
    desc: '+1 исследование. Сыграй снова',
  },
  {
    name: 'Ложная информация',
    desc: '1 Урон по вражеским исследованиям. Сыграй снова',
  },
  {
    name: 'Изучение',
    desc: '+3 исследования',
  },
  {
    name: 'Грамота',
    desc: '+1 Престиж',
  },
  {
    name: 'Шанс',
    desc: 'Возьмите 1 карту. Сбросьте 1 карту. Сыграйте снова',
  },
  {
    name: 'Статья в журнале',
    desc: '+3 исследования. Эту карту нельзя сбросить не сыграв ее',
  },
  {
    name: 'Лазутчики',
    desc: '+2 исследования. 2 урона вражеским исследованиям ',
  },
  {
    name: 'Проведение межрегиональной конференции',
    desc: '+1 Престиж. +3 исследования. +1 к вражеским исследованиям',
  },
  {
    name: 'Упущенные возможности',
    desc: '3 ед. урона 3 вражеским исследованиям',
  },
  {
    name: 'Неисследованная тема',
    desc: '+5 исследования',
  },
  {
    name: 'Саботаж',
    desc: '5 урона вражеским исследованиям',
  },
  {
    name: 'Сильная команда',
    desc: '5 урона вашим исследованиям. +2 престижа',
  },
  {
    name: 'Научный фильм',
    desc: '+1 престиж. +3 исследования. +3 Публикации',
  },
  {
    name: 'Слава',
    desc: 'Весь престиж игрока равен максимальному престижу игрока.',
  },
  {
    name: 'Хорошая статья',
    desc: '+8 исследования',
  },
  {
    name: 'Публикация журнала',
    desc: '+5 исследования. +1 престиж',
  },
  {
    name: 'Срыв конференции',
    desc: '-1 Престиж. 9 урона вражеским исследованиям',
  },
  {
    name: 'Заговор',
    desc: '+5 исследования. Враг теряет 6 научных данных',
  },
  {
    name: 'Среднее открытие',
    desc: '+11 исследований',
  },
  {
    name: 'Комиссия по борьбе с лженаукой',
    desc: '7 урона обоим исследованиям, всем игрокам -1',
  },
  {
    name: 'Победа по статьям',
    desc: '+6 исследований. 4 урона вражеским исследованиям',
  },
  {
    name: 'Тупиковые исследования',
    desc: '+7 исследований Потеряйте 10 научных данных',
  },
  {
    name: 'Участие в конференции',
    desc: '+8 исследований. +3 Публикации',
  },
  {
    name: 'Участие в мероприятии',
    desc: '+8 исследований. +1 персонал',
  },
  {
    name: 'Маленькое открытие',
    desc: '+15 исследований',
  },
  {
    name: 'Сотрудничество с производстом',
    desc: '+10 исследований. +5 Публикаций, прирост 5 денег',
  },
  {
    name: 'Победа в конкурсе',
    desc: '+12 исследований. 6 урона врагу',
  },
  {
    name: 'Крупное открытие',
    desc: '+20 исследований',
  },
  {
    name: 'Упор в исследования',
    desc: '+11 исследований. -6 Публикаций',
  },
  {
    name: 'Соперничество',
    desc: 'Если исследования < вражеских исследований, +2 исследования. Еще +1 исследования',
  },
  {
    name: 'Получение грантов',
    desc: '+1 исследование всем игрокам. Ваш прирост 5 денег',
  },
  {
    name: 'Переработки',
    desc: '+4 исследования, потеряйте 3 человекочаса, 2 урона вражеским исследованиям',
  },
  {
    name: 'Победа в междунардном конкурсе',
    desc: 'Если исследования > вражеских исследований, 8 урона вражеским исследованиям. Еще 8 урона',
  },
  {
    name: 'Участие в мировой конференции',
    desc: '+13 исследований. +6 человекочасов. +6 научных данных',
  },
  {
    name: 'Эпидемия',
    desc: 'Все игроки теряют 6 человекочасов',
  },
  {
    name: 'Вражда',
    desc: '2 Урона. Сыграйте снова',
  },
  {
    name: 'Свой человек',
    desc: '4 Урона. Потеряйте 3 денежки',
  },
  {
    name: 'Наём лаборанта',
    desc: '+1 персонал',
  },
  {
    name: 'Перевыбор',
    desc: 'Возьмите 1 карту. Сбросьте 1 карту. Сыграйте снова',
  },
  {
    name: 'Ложня информация',
    desc: '6 Урона. Вы получаете 3 урона',
  },
  {
    name: 'Сдаем позиции',
    desc: '3 Вражеским публикациям. Вы получаете 1 урон',
  },
  {
    name: 'Компромат',
    desc: '2 Урона вражеским публикациям. Сыграйте снова',
  },
  {
    name: 'Потасовка за углом',
    desc: '5 ед. урона врагу',
  },
  {
    name: 'Украсть статью',
    desc: '4 Урона. +3 Публикации',
  },
  {
    name: 'Тупиковое исследование',
    desc: '4 Урона вражеским исследованиям',
  },
  {
    name: 'Наём ',
    desc: '+2 Персонала',
  },
  {
    name: 'Лидерство',
    desc: '2 Урона. +4 исследования. +2 Публикации',
  },
  {
    name: 'Популяризация науки',
    desc: '+1 персонал всем игрокам. Ваш прирост 3 денежки',
  },
  {
    name: 'Граната',
    desc: '6 Урона',
  },
  {
    name: 'Подрыв',
    desc: '7 Урона',
  },
  {
    name: 'Строгое начальство',
    desc: '6 Урона. Враг теряет 3 человекочаса',
  },
  {
    name: 'Землетрясение',
    desc: '6 Урона. Все игроки теряют 5 научных данных, денег и человекочасов',
  },
  {
    name: 'Закончились сроки публикации',
    desc: 'Если вражеские публикации = 0, 10 урона, еще 6 урона',
  },
  {
    name: 'Коктель молотова',
    desc: '9 Урона',
  },
  {
    name: 'Перемены',
    desc: 'Если вражеская стена > 0, 10 урона, еще 7 урона',
  },
  {
    name: 'Давление авторитетом',
    desc: 'Если престиж > вражеский престиж, 12 урона, еще 8 урона',
  },
  {
    name: 'Обвинение в плагиате',
    desc: 'Если публикации > вражеских публикаций, 6 урона вражеским публикациям, еще 6 урона',
  },
  {
    name: 'Критика статьи',
    desc: '5 урона вражеским публикациям, враг теряет 8 человекочасов',
  },
  {
    name: 'Порча оборудования',
    desc: '8 Урона, -1 вражеское оборудование',
  },
  {
    name: 'Кража',
    desc: 'Враг теряет 10 денег, 5 научных данных, ваш прирост 1/2 единицы округляется',
  },
  {
    name: 'Переманить инвесторов',
    desc: '10 урона. +4 инвестиций',
  },
  {
    name: 'Разочарование компанией',
    desc: '10 Урона.Враг теряет 5 человекочасов, -1 вражеский персонал',
  },
  {
    name: 'Заказное убийство',
    desc: '20 Урона. Враг теряет 10 денег, -1 вражеских персонала',
  },
  {
    name: 'Прорывное исследование',
    desc: 'Если публикаций > вражеских публикаций 3 урона, еще 2 урона',
  },
  {
    name: 'Разоблачение',
    desc: '3 урона. +1 денежка',
  },
  {
    name: 'Черный пиар',
    desc: '8 Урона. 3 урона вашим исследованиям',
  },
  {
    name: 'Взлом',
    desc: '13 урона. Вы теряете 3 денежки',
  },
  {
    name: 'Палки в колеса',
    desc: '12 Урона вражеским исследованиям',
  },
]
